ipv4shh/ESPTOOL2/ESP32_S3/ESP32_S3_ATTACK/ESP32_S3_ATTACK.ino
  // SRX (0x34)
  digitalWrite(CC1101_CS, LOW);
  SPI.beginTransaction(SPISettings(8000000, MSBFIRST, SPI_MODE0));
  SPI.transfer(0x34);
  SPI.endTransaction();
  digitalWrite(CC1101_CS, HIGH);
}

void setCC1101_Idle() {
  digitalWrite(CC1101_CS, LOW);
  SPI.beginTransaction(SPISettings(8000000, MSBFIRST, SPI_MODE0));
  SPI.transfer(0x36); // SIDLE
  SPI.endTransaction();
  digitalWrite(CC1101_CS, HIGH);
}

int getCC1101_RSSI() {
  uint8_t rssi_raw = readReg(0x34);
  int rssi_dbm;
  if (rssi_raw >= 128) {
    rssi_dbm = (rssi_raw - 256) / 2 - 74;
  } else {
    rssi_dbm = rssi_raw / 2 - 74;
  }
  return rssi_dbm;
}

void startSubGhzScan() {
  sendLogToMaster("[Sub-GHz Scanner] Checking CC1101 SPI connection...");
  
  bool hwPresent = checkCC1101();
  if (!hwPresent) {
    sendLogToMaster("[Sub-GHz Scanner] CC1101 not detected. Running demo scan...");
    float frequencies[] = {315.00, 433.92, 868.35};
    for (int i = 0; i < 3; i++) {
      char buf[64];
      int dummyRssi = random(-105, -95);
      snprintf(buf, sizeof(buf), "[Sub-GHz] Freq %.2f MHz: RSSI %d dBm [CLEAN]", frequencies[i], dummyRssi);
      sendLogToMaster(buf);
      delay(500);
    }
    sendLogToMaster("[Sub-GHz Scanner] Demo scan finished.");
    return;
  }
  
  sendLogToMaster("[Sub-GHz Scanner] CC1101 detected! Scanning spectrum...");
  float frequencies[] = {315.00, 433.92, 868.35};
  
  for (int i = 0; i < 3; i++) {
    float freq = frequencies[i];
    setCC1101_Frequency(freq);
    delay(150);
    
    int rssi = getCC1101_RSSI();
    char buf[64];
    if (rssi > -75) {
      snprintf(buf, sizeof(buf), "[Sub-GHz] Freq %.2f MHz: RSSI %d dBm [ACTIVE SIGNAL DETECTED!]", freq, rssi);
    } else if (rssi > -90) {
      snprintf(buf, sizeof(buf), "[Sub-GHz] Freq %.2f MHz: RSSI %d dBm [MODERATE NOISE]", freq, rssi);
    } else {
      snprintf(buf, sizeof(buf), "[Sub-GHz] Freq %.2f MHz: RSSI %d dBm [CLEAN]", freq, rssi);
    }
    sendLogToMaster(buf);
    delay(500);
  }
  setCC1101_Idle();
  sendLogToMaster("[Sub-GHz Scanner] Scan finished.");
}

void startIRScan() {
  sendLogToMaster("[IR Scanner] Point remote at receiver and press a button...");
  pinMode(IR_RX_PIN, INPUT);
  
  unsigned long startTime = millis();
  bool captured = false;
  
  while (millis() - startTime < 6000) { // Scan for 6 seconds
    esp_task_wdt_reset();
    if (digitalRead(IR_RX_PIN) == LOW) { // IR receiver output active-low
      unsigned long lowPulse = pulseIn(IR_RX_PIN, LOW, 15000);
      unsigned long highPulse = pulseIn(IR_RX_PIN, HIGH, 15000);
      
      if (lowPulse > 8000 && lowPulse < 10000 && highPulse > 4000 && highPulse < 5000) {
        // Decode NEC 32 bits
        uint32_t code = 0;
        bool ok = true;
        
        for (int i = 0; i < 32; i++) {
          esp_task_wdt_reset();
          unsigned long bitLow = pulseIn(IR_RX_PIN, LOW, 2000);
          unsigned long bitHigh = pulseIn(IR_RX_PIN, HIGH, 2000);
          
          if (bitLow == 0 || bitHigh == 0) {
            ok = false;
            break;
          }
          
          code <<= 1;
          if (bitHigh > 1000) {
            code |= 1;
          }
        }
        
        if (ok) {
          char buf[64];
          snprintf(buf, sizeof(buf), "[IR Scanner] Captured NEC Code: 0x%08X", code);
          sendLogToMaster(buf);
          captured = true;
          break;
        }
      }
      
      delay(100);
      sendLogToMaster("[IR Scanner] Captured RAW IR transmission!");
      captured = true;
      break;
    }
    delay(5);
  }
  
  if (!captured) {
    sendLogToMaster("[IR Scanner] Scan timeout. No signal detected.");
  }
}

void startSubGhzReplay() { sendLogToMaster("[Error] Sub-GHz Replay requires CC1101"); }
void startSubGhzJammer() { sendLogToMaster("[Error] Sub-GHz Jammer requires CC1101"); }
void startIRReplay() { sendLogToMaster("[Error] IR Replay requires IR-led"); }

// ===== RESTORE WIFI =====
void restoreWiFiState() {
  WiFi.mode(WIFI_STA);
  WiFi.disconnect();
  WiFi.setSleep(false);
  esp_wifi_set_promiscuous(true);
  esp_wifi_set_channel(1, WIFI_SECOND_CHAN_NONE);
  esp_wifi_set_promiscuous(false);
}

// ===== STOP ATTACKS =====
void stopAttack() {
  attackRunning = false;
  currentAttack = "";
  bleJammerInitialized = false;
  sourAppleInitialized = false;
  evilTwinStarted = false;
  lastStationCount = 0;

  WiFi.softAPdisconnect(true);
  if (BLEDevice::getAdvertising()) {
    BLEDevice::getAdvertising()->stop();
  }
  esp_wifi_set_promiscuous(false);
  restoreWiFiState();
  digitalWrite(LED_PIN, LOW);
  
  // Send direct confirmation to Master
  if (hasMasterMac) {
    struct_message response = {};
    strlcpy(response.command, "stopped", sizeof(response.command));
    strlcpy(response.attack, "", sizeof(response.attack));
    strlcpy(response.logMsg, "All attacks stopped. Standby mode.", sizeof(response.logMsg));
    
    XOR_crypt((uint8_t*)&response, sizeof(response)); // Encrypt
    
    for (int retry = 0; retry < 3; retry++) {
      esp_err_t result = esp_now_send(masterMacAddress, (uint8_t *)&response, sizeof(response));
      if (result == ESP_OK) {
        break;
      }
      Serial.printf("[ESP-NOW] Failed to send stopped confirmation (attempt %d/3), err: %d\n", retry + 1, result);
      delay(5);
    }
  }
  
  Serial.println("All attacks stopped");
}

// ===== SEND PONG TO MASTER WITH CURRENT TEMP =====
void sendPong(const uint8_t *masterMac) {
  esp_now_peer_info_t peer;
  memset(&peer, 0, sizeof(peer));
  memcpy(peer.peer_addr, masterMac, 6);
  peer.channel = 1;
  peer.encrypt = false;
  
  if (!esp_now_is_peer_exist(masterMac)) {
    if (esp_now_add_peer(&peer) != ESP_OK) {
      Serial.println("Failed to add peer");
    }
  }
  
  struct_message response = {};
  strlcpy(response.command, "pong", sizeof(response.command));
  strlcpy(response.attack, "", sizeof(response.attack));
  
  // Read Slave Board temperature
  float sTemp = getBoardTemp();
  snprintf(response.logMsg, sizeof(response.logMsg), "%.1f", sTemp);
  
  XOR_crypt((uint8_t*)&response, sizeof(response)); // Encrypt
  
  for (int retry = 0; retry < 3; retry++) {
    esp_err_t result = esp_now_send(masterMac, (uint8_t *)&response, sizeof(response));
    if (result == ESP_OK) {
      break;
    }
    Serial.printf("[ESP-NOW] Failed to send pong to Master (attempt %d/3), err: %d\n", retry + 1, result);
    delay(5);
  }
}

void registerMasterPeer(const uint8_t *mac) {
  esp_now_peer_info_t peer;
  memset(&peer, 0, sizeof(peer));
  memcpy(peer.peer_addr, mac, 6);
  peer.channel = 1;
  peer.encrypt = false;
  
  if (esp_now_is_peer_exist(mac)) {
    esp_now_del_peer(mac);
  }
  if (esp_now_add_peer(&peer) != ESP_OK) {
    Serial.println("Failed to add peer");
  }
}

// ===== ESP-NOW HANDLER =====
#if defined(ESP_ARDUINO_VERSION_MAJOR) && ESP_ARDUINO_VERSION_MAJOR >= 3
void OnDataRecv(const esp_now_recv_info_t *info, const uint8_t *incomingData, int len) {
  const uint8_t *srcMac = info->src_addr;
#else
void OnDataRecv(const uint8_t *mac_addr, const uint8_t *incomingData, int len) {
  const uint8_t *srcMac = mac_addr;
#endif
  if (len != sizeof(myData)) {
    Serial.printf("Invalid packet len: %d\n", len);
    return;
  }
  memcpy(&myData, incomingData, sizeof(myData));
  XOR_crypt((uint8_t*)&myData, sizeof(myData)); // Decrypt
  myData.command[15] = '\0';
  myData.attack[31] = '\0';

