ipv4shh/ESPTOOL2/ESP32_S3/ESP32_S3_ATTACK/ESP32_S3_ATTACK.ino
  // Store Master MAC
  if (!hasMasterMac || memcmp(masterMacAddress, srcMac, 6) != 0) {
    memcpy(masterMacAddress, srcMac, 6);
    hasMasterMac = true;
    Serial.printf("Master MAC registered: %02X:%02X:%02X:%02X:%02X:%02X\n",
                  srcMac[0], srcMac[1], srcMac[2], srcMac[3], srcMac[4], srcMac[5]);
    
    registerMasterPeer(srcMac); // Add Master as peer
    
    // Save to Preferences
    Preferences prefs;
    prefs.begin("esptool2", false);
    prefs.putBytes("masterMac", masterMacAddress, 6);
    prefs.putBool("hasMasterMac", true);
    prefs.end();
  }

  lastMasterHeardTime = millis();

  if (strcmp(myData.command, "ping") == 0) {
    Serial.println("Received PING, sending PONG...");
    sendPong(srcMac);
    return;
  }

  Serial.print("Received: command ");
  Serial.print(myData.command);
  Serial.print(" | target ");
  Serial.println(myData.attack);

  if (strcmp(myData.command, "start") == 0) {
    if (attackRunning) {
      sendLogToMaster("[Warning] Attack already active");
      Serial.println("Attack already active");
      return;
    }
    attackRunning = true;
    currentAttack = String(myData.attack);
    
    char buf[64];
    snprintf(buf, sizeof(buf), "Starting task: %s", myData.attack);
    sendLogToMaster(buf);
  } else if (strcmp(myData.command, "stop") == 0) {
    stopAttack();
  } else {
    Serial.println("Unknown command");
  }
}

// ===== SETUP =====
void setup() {
  Serial.begin(115200);
  randomSeed(esp_random());
  esp_task_wdt_init(15, true);
  esp_task_wdt_add(NULL);
  
  pinMode(LED_PIN, OUTPUT);
  digitalWrite(LED_PIN, LOW);

  WiFi.mode(WIFI_AP_STA);
  WiFi.disconnect();
  WiFi.setSleep(false);

  // Channel 1 for stable ESP-NOW
  esp_wifi_set_promiscuous(true);
  esp_wifi_set_channel(1, WIFI_SECOND_CHAN_NONE);
  esp_wifi_set_promiscuous(false);

  // Initialize BLE stack once
  BLEDevice::init("ESP32-S3");

  // SCK=12, MISO=13, MOSI=11, CS=10
  SPI.begin(12, 13, 11, 10);

  // Check CC1101 connection
  if (checkCC1101()) {
    Serial.println("CC1101 found!");
  } else {
    Serial.println("CC1101 not found.");
  }

  if (esp_now_init() != ESP_OK) {
    Serial.println("ESP-NOW init error");
    return;
  }
  esp_now_register_recv_cb(OnDataRecv);
  
  // Load paired Master MAC from Preferences
  Preferences prefs;
  prefs.begin("esptool2", false);
  if (prefs.getBool("hasMasterMac", false)) {
    prefs.getBytes("masterMac", masterMacAddress, 6);
    hasMasterMac = true;
    Serial.printf("Loaded Master MAC from Flash: %02X:%02X:%02X:%02X:%02X:%02X\n",
                  masterMacAddress[0], masterMacAddress[1], masterMacAddress[2], 
                  masterMacAddress[3], masterMacAddress[4], masterMacAddress[5]);
    
    registerMasterPeer(masterMacAddress); // Register Master as peer
  }
  prefs.end();

  lastMasterHeardTime = millis();
  Serial.println("SLAVE ready for commands");
  Serial.print("My MAC: ");
  Serial.println(WiFi.macAddress());
}

// ===== LOOP =====
void loop() {
  esp_task_wdt_reset();
  updateLedIndicator();
  
  // Safety timeout: stop attack if Master connection is lost for >15 seconds
  if (attackRunning && hasMasterMac && (millis() - lastMasterHeardTime > 15000)) {
    Serial.println("Master connection timeout. Stopping attack.");
    stopAttack();
  }
  
  if (attackRunning && currentAttack != "") {
    // Periodically return to Channel 1 to listen for Master command (stop/ping)
    // Prevents "deaf transceiver" issue during active channel-hopping/jamming attacks
    if (millis() - lastListenTime >= 1000) {
      esp_wifi_set_promiscuous(false);
      esp_wifi_set_channel(1, WIFI_SECOND_CHAN_NONE);
      
      // Wait for 500ms on Channel 1 to receive incoming ESP-NOW command
      unsigned long startListen = millis();
      while (millis() - startListen < 500) {
        delay(1); 
        yield();
      }
      
      lastListenTime = millis();
      if (!attackRunning) return; // Exit if stopped during listening window
    }
    
    bool boost = currentAttack.endsWith("_boost");
    String baseAttackName = boost ? currentAttack.substring(0, currentAttack.length() - 6) : currentAttack;
    
    if (baseAttackName == "beacon") {
      runBeaconSpamStep(boost);
    }
    else if (baseAttackName == "deauth") {
      runDeauthStep(boost);
    }
    else if (baseAttackName == "probe") {
      runProbeFloodStep();
    }
    else if (baseAttackName == "powerful_jammer") {
      runPowerfulJammerStep();
    }
    else if (baseAttackName == "wifi_scan") {
      startWiFiScan();
      attackRunning = false;
      currentAttack = "";
      restoreWiFiState();
    }
    else if (baseAttackName == "evil_twin") {
      if (!evilTwinStarted) {
        startEvilTwin();
        evilTwinStarted = true;
        lastStationCount = -1;
      }
      runEvilTwinStep();
    }
    else if (baseAttackName == "ble_scan") {
      startBLEScan();
      attackRunning = false;
      currentAttack = "";
    }
    else if (baseAttackName == "ble_spoofer") {
      startBLESpoofer();
    }
    else if (baseAttackName == "ble_jammer") {
      runBLEJammerStep();
    }
    else if (baseAttackName == "sour_apple") {
      runSourAppleStep(boost);
    }
    else if (baseAttackName == "ghz_scan") { startGhzScan(); attackRunning = false; currentAttack = ""; }
    else if (baseAttackName == "protokill") { currentAttack = "powerful_jammer"; attackRunning = true; }
    else if (baseAttackName == "subghz_scan") { startSubGhzScan(); attackRunning = false; currentAttack = ""; }
    else if (baseAttackName == "subghz_replay") { startSubGhzReplay(); attackRunning = false; currentAttack = ""; }
    else if (baseAttackName == "subghz_jammer") { startSubGhzJammer(); attackRunning = false; currentAttack = ""; }
    else if (baseAttackName == "ir_scan") { startIRScan(); attackRunning = false; currentAttack = ""; }
    else if (baseAttackName == "ir_replay") { startIRReplay(); attackRunning = false; currentAttack = ""; }
  }
  delay(1);
}
